_posts/algorithms/2013-10-01-ACM.html
---
layout: post
title: ACM
author: zrg
comments: false
description: ACM 编程
categories:
- Algorithms
tags:
- ACM
photos:
---

<div id="outline-container-orgace0805" class="outline-2">
<h2 id="orgace0805">1～100</h2>
<div class="outline-text-2" id="text-orgace0805">
</div>
<div id="outline-container-org42ded1c" class="outline-3">
<h3 id="org42ded1c">A+B problem</h3>
<div class="outline-text-3" id="text-org42ded1c">
<pre class="example">
描述
	此题为练手用题，请大家计算一下a+b的值.
输入
	输入两个数，a,b
输出
	输出a+b的值

</pre>
<div class="org-src-container">
<pre class="src src-C" id="orgee3326b"><span style="color: #483d8b;">#include</span><span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(){
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>;
        printf(<span style="color: #8b2252;">"&#35831;&#36755;&#20837;&#20004;&#20010;&#25972;&#25968;(&#29992;&#36887;&#21495;&#20998;&#38548;)&#65306;"</span>);
        scanf(<span style="color: #8b2252;">"%d,%d"</span>,&amp;a,&amp;b);
        printf(<span style="color: #8b2252;">"%d\n"</span>,a+b);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++" id="org35436c6"><span style="color: #483d8b;">#include</span><span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(){
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span>,<span style="color: #a0522d;">b</span>;
        cin&gt;&gt;a&gt;&gt;b;
        cout&lt;&lt;a+b&lt;&lt;endl;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org04015a6" class="outline-3">
<h3 id="org04015a6">括号配对问题</h3>
<div class="outline-text-3" id="text-org04015a6">
<pre class="example">
描述
	现在，有一行括号序列，请你检查这行括号是否配对。
输入
	第一行输入一个数N（0&lt;N&lt;=100）,表示有N组测试数据。后面的N行输入多组输入数据，每组输入数据都是一个字符串S(S的长度小于10000，且S不是空串），测试数据组数少于5组。数据保证S中只含有"[", "]", "(", ")" 四种字符
输出
	每组输入数据的输出占一行，如果该字符串中所含的括号是配对的，则输出Yes,如果不配对则输出No

</pre>
<div class="org-src-container">
<pre class="src src-C" id="orga05ca87">
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb80893a" class="outline-3">
<h3 id="orgb80893a">多边形重心问题</h3>
<div class="outline-text-3" id="text-orgb80893a">
<pre class="example">
描述
	在某个多边形上，取n个点，这n个点顺序给出，按照给出顺序将相邻的点用直线连接， （第一个和最后一个连接），所有线段不和其他线段相交，但是可以重合，可得到一个多边形或一条线段或一个多边形和一个线段的连接后的图形； 
	如果是一条线段,我们定义面积为0，重心坐标为（0,0）.现在求给出的点集组成的图形的面积和重心横纵坐标的和；
输入
	第一行有一个整数0&lt;n&lt;11,表示有n组数据；
	每组数据第一行有一个整数m&lt;10000,表示有这个多边形有m个顶点；
输出
	输出每个多边形的面积、重心横纵坐标的和，小数点后保留三位；

</pre>
<div class="org-src-container">
<pre class="src src-C" id="org6f0dced">
</pre>
</div>
</div>
</div>
<div id="outline-container-org0682678" class="outline-3">
<h3 id="org0682678">ASCII码排序</h3>
<div class="outline-text-3" id="text-org0682678">
<pre class="example">
描述
	输入三个字符（可以重复）后，按各字符的ASCII码从小到大的顺序输出这三个字符。
输入
	第一行输入一个数N,表示有N组测试数据。后面的N行输入多组数据，每组输入数据都是占一行，有三个字符组成，之间无空格。
输出
	对于每组输入数据，输出一行，字符中间用一个空格分开。

</pre>
<div class="org-src-container">
<pre class="src src-C" id="org8a1960d">
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb76656c" class="outline-3">
<h3 id="orgb76656c"></h3>
<div class="outline-text-3" id="text-orgb76656c">
<div class="org-src-container">
<pre class="src src-C" id="orge6fb708">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org66eca76">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgc9180f3">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orga83e3ce">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgf2d5299">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org3ca3a56">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org95cdb2f">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org6dac189">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org9fd3263">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org722fa54">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org8dfdcd6">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org35654d9">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orge215f35">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org2661982">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgcb3ca51">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgc5e261e">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgeab963c">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org9a578c0">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org4d13bd4">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org517973b">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgf841928">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org61f8f15">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgc60d15d">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgf3298f9">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgb93f576">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org15dca0f">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org06dc8a8">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgcd6c13d">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgc6f7cb8">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org488b0f2">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org86a1231">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orgb765f31">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="orga40d654">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-C" id="org349bec7">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org50cc365" class="outline-2">
<h2 id="org50cc365">101~200</h2>
<div class="outline-text-2" id="text-org50cc365">
</div>
<div id="outline-container-org56bfb63" class="outline-3">
<h3 id="org56bfb63"></h3>
<div class="outline-text-3" id="text-org56bfb63">
<div class="org-src-container">
<pre class="src src-C" id="orgb1655e7">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org907ef91" class="outline-2">
<h2 id="org907ef91">201~300</h2>
</div>
<div id="outline-container-org3f432a1" class="outline-2">
<h2 id="org3f432a1">301~400</h2>
</div>
<div id="outline-container-orgc95458c" class="outline-2">
<h2 id="orgc95458c">题目来源</h2>
<div class="outline-text-2" id="text-orgc95458c">
<pre class="example">
南京理工大学 ACM ：http://acm.nyist.edu.cn

</pre>
</div>
</div>
